#2 types
1. Series
2. DataFrame

In [37]:
#series
import pandas as pd

In [38]:
dir(pd)

['BooleanDtype',
 'Categorical',
 'CategoricalDtype',
 'CategoricalIndex',
 'DataFrame',
 'DateOffset',
 'DatetimeIndex',
 'DatetimeTZDtype',
 'ExcelFile',
 'ExcelWriter',
 'Float64Index',
 'Grouper',
 'HDFStore',
 'Index',
 'IndexSlice',
 'Int16Dtype',
 'Int32Dtype',
 'Int64Dtype',
 'Int64Index',
 'Int8Dtype',
 'Interval',
 'IntervalDtype',
 'IntervalIndex',
 'MultiIndex',
 'NA',
 'NaT',
 'NamedAgg',
 'Period',
 'PeriodDtype',
 'PeriodIndex',
 'RangeIndex',
 'Series',
 'SparseDtype',
 'StringDtype',
 'Timedelta',
 'TimedeltaIndex',
 'Timestamp',
 'UInt16Dtype',
 'UInt32Dtype',
 'UInt64Dtype',
 'UInt64Index',
 'UInt8Dtype',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__docformat__',
 '__file__',
 '__getattr__',
 '__git_version__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__',
 '_config',
 '_hashtable',
 '_is_numpy_dev',
 '_lib',
 '_libs',
 '_np_version_under1p16',
 '_np_version_under1p17',
 '_np_version_under1p18',
 '_testing',
 '_tslib',
 '_typing',
 '_version',
 'api',
 'array',
 'arrays',
 'bdate_range',
 'compat',
 'concat',
 'core',
 'crosstab',
 'cut',
 'date_range',
 'describe_option',
 'errors',
 'eval',
 'factorize',
 'get_dummies',
 'get_option',
 'infer_freq',
 'interval_range',
 'io',
 'isna',
 'isnull',
 'json_normalize',
 'lreshape',
 'melt',
 'merge',
 'merge_asof',
 'merge_ordered',
 'notna',
 'notnull',
 'offsets',
 'option_context',
 'options',
 'pandas',
 'period_range',
 'pivot',
 'pivot_table',
 'plotting',
 'qcut',
 'read_clipboard',
 'read_csv',
 'read_excel',
 'read_feather',
 'read_fwf',
 'read_gbq',
 'read_hdf',
 'read_html',
 'read_json',
 'read_orc',
 'read_parquet',
 'read_pickle',
 'read_sas',
 'read_spss',
 'read_sql',
 'read_sql_query',
 'read_sql_table',
 'read_stata',
 'read_table',
 'reset_option',
 'set_eng_float_format',
 'set_option',
 'show_versions',
 'test',
 'testing',
 'timedelta_range',
 'to_datetime',
 'to_numeric',
 'to_pickle',
 'to_timedelta',
 'tseries',
 'unique',
 'util',
 'value_counts',
 'wide_to_long']

In [39]:
marks=[80,90,100,120]

In [40]:
type(marks)

list

In [41]:
ser=pd.Series(marks)

In [42]:
ser

0     80
1     90
2    100
3    120
dtype: int64

In [43]:
ser[0:1]

0    80
dtype: int64

In [44]:
marks=[80,90,100,120]
labels=['maths','science','physics','chemistry']
ser=pd.Series(marks,labels)

In [45]:
ser

maths         80
science       90
physics      100
chemistry    120
dtype: int64

In [46]:
type(ser)

pandas.core.series.Series

In [47]:
ser['maths']

80

In [48]:
ser['maths':'science']

maths      80
science    90
dtype: int64

In [49]:
#creating series from numpy array
import numpy as np

v=np.array([1,2,3,4,5,6,7])

In [50]:
type(v)

numpy.ndarray

In [51]:
s1=pd.Series(v)

In [52]:
s1

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int32

In [53]:
type(s1)

pandas.core.series.Series

In [56]:
pd.__version__

'1.1.3'

In [57]:
dir(s1)

['T',
 '_AXIS_LEN',
 '_AXIS_NAMES',
 '_AXIS_NUMBERS',
 '_AXIS_ORDERS',
 '_AXIS_REVERSED',
 '_AXIS_TO_AXIS_NUMBER',
 '_HANDLED_TYPES',
 '__abs__',
 '__add__',
 '__and__',
 '__annotations__',
 '__array__',
 '__array_priority__',
 '__array_ufunc__',
 '__array_wrap__',
 '__bool__',
 '__class__',
 '__contains__',
 '__copy__',
 '__deepcopy__',
 '__delattr__',
 '__delitem__',
 '__dict__',
 '__dir__',
 '__div__',
 '__divmod__',
 '__doc__',
 '__eq__',
 '__finalize__',
 '__float__',
 '__floordiv__',
 '__format__',
 '__ge__',
 '__getattr__',
 '__getattribute__',
 '__getitem__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__iadd__',
 '__iand__',
 '__ifloordiv__',
 '__imod__',
 '__imul__',
 '__init__',
 '__init_subclass__',
 '__int__',
 '__invert__',
 '__ior__',
 '__ipow__',
 '__isub__',
 '__iter__',
 '__itruediv__',
 '__ixor__',
 '__le__',
 '__len__',
 '__long__',
 '__lt__',
 '__matmul__',
 '__mod__',
 '__module__',
 '__mul__',
 '__ne__',
 '__neg__',
 '__new__',
 '__nonzero__',
 '__or__',
 '__pos__',
 '__pow__',
 '__radd__',
 '__rand__',
 '__rdiv__',
 '__rdivmod__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__rfloordiv__',
 '__rmatmul__',
 '__rmod__',
 '__rmul__',
 '__ror__',
 '__round__',
 '__rpow__',
 '__rsub__',
 '__rtruediv__',
 '__rxor__',
 '__setattr__',
 '__setitem__',
 '__setstate__',
 '__sizeof__',
 '__str__',
 '__sub__',
 '__subclasshook__',
 '__truediv__',
 '__weakref__',
 '__xor__',
 '_accessors',
 '_add_numeric_operations',
 '_add_series_or_dataframe_operations',
 '_agg_by_level',
 '_agg_examples_doc',
 '_agg_see_also_doc',
 '_aggregate',
 '_aggregate_multiple_funcs',
 '_align_frame',
 '_align_series',
 '_binop',
 '_builtin_table',
 '_can_hold_na',
 '_check_inplace_setting',
 '_check_is_chained_assignment_possible',
 '_check_label_or_level_ambiguity',
 '_check_setitem_copy',
 '_clear_item_cache',
 '_clip_with_one_bound',
 '_clip_with_scalar',
 '_consolidate',
 '_consolidate_inplace',
 '_construct_axes_dict',
 '_construct_axes_from_arguments',
 '_construct_result',
 '_constructor',
 '_constructor_expanddim',
 '_constructor_sliced',
 '_convert',
 '_convert_dtypes',
 '_cython_table',
 '_data',
 '_deprecations',
 '_dir_additions',
 '_dir_deletions',
 '_drop_axis',
 '_drop_labels_or_levels',
 '_find_valid_index',
 '_get_axis',
 '_get_axis_name',
 '_get_axis_number',
 '_get_axis_resolvers',
 '_get_block_manager_axis',
 '_get_bool_data',
 '_get_cacher',
 '_get_cleaned_column_resolvers',
 '_get_cython_func',
 '_get_index_resolvers',
 '_get_item_cache',
 '_get_label_or_level_values',
 '_get_numeric_data',
 '_get_value',
 '_get_values',
 '_get_values_tuple',
 '_get_with',
 '_gotitem',
 '_index',
 '_indexed_same',
 '_info_axis',
 '_info_axis_name',
 '_info_axis_number',
 '_init_dict',
 '_init_mgr',
 '_internal_names',
 '_internal_names_set',
 '_is_builtin_func',
 '_is_cached',
 '_is_copy',
 '_is_label_or_level_reference',
 '_is_label_reference',
 '_is_level_reference',
 '_is_mixed_type',
 '_is_view',
 '_iset_item',
 '_ix',
 '_ixs',
 '_map_values',
 '_maybe_cache_changed',
 '_maybe_update_cacher',
 '_metadata',
 '_needs_reindex_multi',
 '_obj_with_exclusions',
 '_protect_consolidate',
 '_reduce',
 '_reindex_axes',
 '_reindex_indexer',
 '_reindex_multi',
 '_reindex_with_indexers',
 '_repr_data_resource_',
 '_repr_latex_',
 '_reset_cache',
 '_reset_cacher',
 '_selected_obj',
 '_selection',
 '_selection_list',
 '_selection_name',
 '_set_as_cached',
 '_set_axis',
 '_set_axis_name',
 '_set_is_copy',
 '_set_item',
 '_set_name',
 '_set_value',
 '_set_with',
 '_set_with_engine',
 '_slice',
 '_stat_axis',
 '_stat_axis_name',
 '_stat_axis_number',
 '_take_with_is_copy',
 '_to_dict_of_blocks',
 '_try_aggregate_string_function',
 '_typ',
 '_update_inplace',
 '_validate_dtype',
 '_values',
 '_where',
 'abs',
 'add',
 'add_prefix',
 'add_suffix',
 'agg',
 'aggregate',
 'align',
 'all',
 'any',
 'append',
 'apply',
 'argmax',
 'argmin',
 'argsort',
 'array',
 'asfreq',
 'asof',
 'astype',
 'at',
 'at_time',
 'attrs',
 'autocorr',
 'axes',
 'backfill',
 'between',
 'between_time',
 'bfill',
 'bool',
 'clip',
 'combine',
 'combine_first',
 'compare',
 'convert_dtypes',
 'copy',
 'corr',
 'count',
 'cov',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'describe',
 'diff',
 'div',
 'divide',
 'divmod',
 'dot',
 'drop',
 'drop_duplicates',
 'droplevel',
 'dropna',
 'dtype',
 'dtypes',
 'duplicated',
 'empty',
 'eq',
 'equals',
 'ewm',
 'expanding',
 'explode',
 'factorize',
 'ffill',
 'fillna',
 'filter',
 'first',
 'first_valid_index',
 'floordiv',
 'ge',
 'get',
 'groupby',
 'gt',
 'hasnans',
 'head',
 'hist',
 'iat',
 'idxmax',
 'idxmin',
 'iloc',
 'index',
 'infer_objects',
 'interpolate',
 'is_monotonic',
 'is_monotonic_decreasing',
 'is_monotonic_increasing',
 'is_unique',
 'isin',
 'isna',
 'isnull',
 'item',
 'items',
 'iteritems',
 'keys',
 'kurt',
 'kurtosis',
 'last',
 'last_valid_index',
 'le',
 'loc',
 'lt',
 'mad',
 'map',
 'mask',
 'max',
 'mean',
 'median',
 'memory_usage',
 'min',
 'mod',
 'mode',
 'mul',
 'multiply',
 'name',
 'nbytes',
 'ndim',
 'ne',
 'nlargest',
 'notna',
 'notnull',
 'nsmallest',
 'nunique',
 'pad',
 'pct_change',
 'pipe',
 'plot',
 'pop',
 'pow',
 'prod',
 'product',
 'quantile',
 'radd',
 'rank',
 'ravel',
 'rdiv',
 'rdivmod',
 'reindex',
 'reindex_like',
 'rename',
 'rename_axis',
 'reorder_levels',
 'repeat',
 'replace',
 'resample',
 'reset_index',
 'rfloordiv',
 'rmod',
 'rmul',
 'rolling',
 'round',
 'rpow',
 'rsub',
 'rtruediv',
 'sample',
 'searchsorted',
 'sem',
 'set_axis',
 'shape',
 'shift',
 'size',
 'skew',
 'slice_shift',
 'sort_index',
 'sort_values',
 'squeeze',
 'std',
 'sub',
 'subtract',
 'sum',
 'swapaxes',
 'swaplevel',
 'tail',
 'take',
 'to_clipboard',
 'to_csv',
 'to_dict',
 'to_excel',
 'to_frame',
 'to_hdf',
 'to_json',
 'to_latex',
 'to_list',
 'to_markdown',
 'to_numpy',
 'to_period',
 'to_pickle',
 'to_sql',
 'to_string',
 'to_timestamp',
 'to_xarray',
 'transform',
 'transpose',
 'truediv',
 'truncate',
 'tz_convert',
 'tz_localize',
 'unique',
 'unstack',
 'update',
 'value_counts',
 'values',
 'var',
 'view',
 'where',
 'xs']

In [58]:
s1.items

<bound method Series.items of 0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int32>

In [59]:
s1.nbytes

28

In [60]:
s1.shape

(7,)

In [61]:
s1.ndim

1

In [62]:
len(s1)

7

In [63]:
s1.count()

7

In [64]:
s0=pd.Series([1,2,3],index=['a','b','c'])

In [65]:
s0

a    1
b    2
c    3
dtype: int64

In [66]:
s1.index=['a','b','c','d','e','f','g']

In [67]:
s1

a    1
b    2
c    3
d    4
e    5
f    6
g    7
dtype: int32

In [68]:
#creating Series from dictionary
dict1={'a1':10,'a2':20,'a3':30,'a4':40}
s3=pd.Series(dict1)
s3

a1    10
a2    20
a3    30
a4    40
dtype: int64

In [71]:
pd.Series(99,index=[0,1,2,3,4,5,6,7,8,9,10])

0     99
1     99
2     99
3     99
4     99
5     99
6     99
7     99
8     99
9     99
10    99
dtype: int64

In [72]:
s1

a    1
b    2
c    3
d    4
e    5
f    6
g    7
dtype: int32

In [74]:
#slicing

In [73]:
s1[:]

a    1
b    2
c    3
d    4
e    5
f    6
g    7
dtype: int32

In [75]:
s1[0:3]

a    1
b    2
c    3
dtype: int32

In [81]:
s1[-3:]

e    5
f    6
g    7
dtype: int32

In [82]:
s1[:3]

a    1
b    2
c    3
dtype: int32

In [84]:
s1[:-3]

a    1
b    2
c    3
d    4
dtype: int32

In [85]:
s1[0:1]

a    1
dtype: int32

In [87]:
s1[-1:]

g    7
dtype: int32

In [88]:
s1[-3:-1]

e    5
f    6
dtype: int32

In [89]:
s3

a1    10
a2    20
a3    30
a4    40
dtype: int64

In [90]:
s2=s3.copy()

In [91]:
s2

a1    10
a2    20
a3    30
a4    40
dtype: int64

In [100]:
s4=s2.append(s3)

In [101]:
s4

a1    10
a2    20
a3    30
a4    40
a1    10
a2    20
a3    30
a4    40
dtype: int64

In [102]:
#drop
s4.drop('a4',inplace=True)

In [103]:
s4

a1    10
a2    20
a3    30
a1    10
a2    20
a3    30
dtype: int64

In [104]:
s4=s4.append(pd.Series({'a4':7}))
s4

a1    10
a2    20
a3    30
a1    10
a2    20
a3    30
a4     7
dtype: int64

In [105]:
v1=np.array([10,20,30])
v2=np.array([1,2,3])
s1=pd.Series(v1)
s2=pd.Series(v2)
s1,s2

(0    10
 1    20
 2    30
 dtype: int32,
 0    1
 1    2
 2    3
 dtype: int32)

In [106]:
s1.add(s2)

0    11
1    22
2    33
dtype: int32

In [107]:
s1.sub(s2) #substract

0     9
1    18
2    27
dtype: int32

In [108]:
s1.add(9)

0    19
1    29
2    39
dtype: int32

In [109]:
s1.mul(s2) #multiply

0    10
1    40
2    90
dtype: int32

In [111]:
s1.divide(s2) #div

0    10.0
1    10.0
2    10.0
dtype: float64

In [112]:
s1.max()

30

In [113]:
s1.min()

10

In [114]:
s1.mean()

20.0

In [115]:
s1.median()

20.0

In [117]:
S = pd.Series([1,2,3,3,3,2,1],index=[0,1,2,3,4,5,6])
S

0    1
1    2
2    3
3    3
4    3
5    2
6    1
dtype: int64

In [118]:
#value_counts
S.value_counts()

3    3
2    2
1    2
dtype: int64

#### DataFrame

In [119]:
import numpy as np
import pandas as pd

In [120]:
a=np.arange(16).reshape(4,4)
a

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [121]:
df=pd.DataFrame(a)

In [122]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [123]:
labels=['a','b','c','d']
label2=['A','B','C','D']

In [124]:
df = pd.DataFrame(a,index=labels,columns=label2)

In [125]:
df

    A   B   C   D
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15

In [126]:
df1=pd.DataFrame([[1,2,3,4],[4,5,6,7],[8,9,10,11],[12,13,14,15]],index='A B C D'.split(), 
             columns="a b c d".split())

In [127]:
df1

    a   b   c   d
A   1   2   3   4
B   4   5   6   7
C   8   9  10  11
D  12  13  14  15

In [128]:
'A B C D'.split()

['A', 'B', 'C', 'D']

In [132]:
df1[['a','b']]

    a   b
A   1   2
B   4   5
C   8   9
D  12  13

In [139]:
df1.loc['C']

a     8
b     9
c    10
d    11
Name: C, dtype: int64

In [144]:
df1.iloc[0:4,0:2]

    a   b
A   1   2
B   4   5
C   8   9
D  12  13

In [ ]:
#DataFrame.loc[]

In [145]:
df1

    a   b   c   d
A   1   2   3   4
B   4   5   6   7
C   8   9  10  11
D  12  13  14  15

In [150]:
df1['new']=df1['a']+df1['b']

In [151]:
df1

    a   b   c   d  new
A   1   2   3   4    3
B   4   5   6   7    9
C   8   9  10  11   17
D  12  13  14  15   25

In [152]:
df1['new2']=[5,6,7,8]

In [153]:
df1

    a   b   c   d  new  new2
A   1   2   3   4    3     5
B   4   5   6   7    9     6
C   8   9  10  11   17     7
D  12  13  14  15   25     8

In [160]:
#drop function
df1.drop('new2',axis=1,inplace=True)

In [161]:
df1

    a   b   c   d  new
A   1   2   3   4    3
B   4   5   6   7    9
C   8   9  10  11   17
D  12  13  14  15   25

In [163]:
df1.drop('D',inplace=True)

In [164]:
df1

   a  b   c   d  new
A  1  2   3   4    3
B  4  5   6   7    9
C  8  9  10  11   17

In [178]:
#head
df1.head(5)

   a  b   c   d  new
A  1  2   3   4    3
B  4  5   6   7    9
C  8  9  10  11   17

In [179]:
#tail
df1.tail()

   a  b   c   d  new
A  1  2   3   4    3
B  4  5   6   7    9
C  8  9  10  11   17

In [191]:
data={'Name':['Ram','Vinay','Surya','Sandeep','Durga'],
     "Age":[24,21,25,27,26],
     "Address":['Hyderabad','Mumbai','Delhi','Kolkata','Chennai'],
     "Qualification":['M Tech','B Tech','MCA','Phd','MCA']}

In [192]:
df=pd.DataFrame(data)

In [193]:
df

      Name  Age    Address Qualification
0      Ram   24  Hyderabad        M Tech
1    Vinay   21     Mumbai        B Tech
2    Surya   25      Delhi           MCA
3  Sandeep   27    Kolkata           Phd
4    Durga   26    Chennai           MCA

In [194]:
df.head(2)

    Name  Age    Address Qualification
0    Ram   24  Hyderabad        M Tech
1  Vinay   21     Mumbai        B Tech

In [195]:
df.tail(2)

      Name  Age  Address Qualification
3  Sandeep   27  Kolkata           Phd
4    Durga   26  Chennai           MCA

In [196]:
df.drop('Address',axis=1,inplace=True)

In [197]:
df

      Name  Age Qualification
0      Ram   24        M Tech
1    Vinay   21        B Tech
2    Surya   25           MCA
3  Sandeep   27           Phd
4    Durga   26           MCA

In [199]:
df['Qualification'].value_counts()

MCA       2
B Tech    1
Phd       1
M Tech    1
Name: Qualification, dtype: int64

In [200]:
df['Qualification'].unique()

array(['M Tech', 'B Tech', 'MCA', 'Phd'], dtype=object)

In [201]:
df.describe()

             Age
count   5.000000
mean   24.600000
std     2.302173
min    21.000000
25%    24.000000
50%    25.000000
75%    26.000000
max    27.000000

In [202]:
df1.describe()

              a         b          c          d        new
count  3.000000  3.000000   3.000000   3.000000   3.000000
mean   4.333333  5.333333   6.333333   7.333333   9.666667
std    3.511885  3.511885   3.511885   3.511885   7.023769
min    1.000000  2.000000   3.000000   4.000000   3.000000
25%    2.500000  3.500000   4.500000   5.500000   6.000000
50%    4.000000  5.000000   6.000000   7.000000   9.000000
75%    6.000000  7.000000   8.000000   9.000000  13.000000
max    8.000000  9.000000  10.000000  11.000000  17.000000

In [203]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           5 non-null      object
 1   Age            5 non-null      int64
 2   Qualification  5 non-null      object
dtypes: int64(1), object(2)
memory usage: 248.0+ bytes

In [205]:
def add(input1,input2,input3):
    c=input1+input2+input3
add(5,6)

TypeError: add() missing 1 required positional argument: 'input3'

In [18]:
import pandas as pd

In [42]:
df3=pd.DataFrame({'A':[1,2,np.NaN],
             'B':[5,np.NaN,np.NaN],
             'C':[1,2,3]})

In [43]:
df3

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [44]:
df3.isnull().any()

A     True
B     True
C    False
dtype: bool

In [22]:
df3.isnull().sum()

A    1
B    2
C    0
dtype: int64

In [211]:
#mean
#median
#mode
#random value

In [23]:
df3.fillna(24)

     A    B  C
0  1.0  5.0  1
1  2.0  1.0  2
2  1.0  1.0  3

In [ ]:
#age, gender, balance, output
        m/f              y/n
    
              24        24

In [ ]:
#for continuous columns, mean or median
#for categorical column, mode

In [24]:
df3

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [32]:
df3['A'].fillna(df3['A'].mean())

In [33]:
df3['B'].fillna(df3['B'].mean())

0    5.0
1    5.0
2    5.0
Name: B, dtype: float64

In [28]:
df3['A'].fillna(df3['A'].median())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [45]:
df3

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [46]:
a=df3['A'].mode()

In [47]:
a

0    1.0
1    2.0
dtype: float64

In [48]:
a[1]

2.0

In [51]:
df3['A'].fillna(df3['A'].mode()[0])

0    1.0
1    2.0
2    1.0
Name: A, dtype: float64

In [63]:
df=pd.DataFrame(["Mumbai",np.nan,'Chennai','Mumbai','Hyderabad','Hyderabad','Delhi','Mumbai','Hyderabad'],columns=['Places'])
df

      Places
0     Mumbai
1        NaN
2    Chennai
3     Mumbai
4  Hyderabad
5  Hyderabad
6      Delhi
7     Mumbai
8  Hyderabad

In [64]:
df.value_counts()

Places
Mumbai       3
Hyderabad    3
Delhi        1
Chennai      1
dtype: int64

In [65]:
a=df.mode()

In [66]:
a

      Places
0  Hyderabad
1     Mumbai

In [71]:
df['Places'].fillna(df['Places'].mode()[1])

0       Mumbai
1       Mumbai
2      Chennai
3       Mumbai
4    Hyderabad
5    Hyderabad
6        Delhi
7       Mumbai
8    Hyderabad
Name: Places, dtype: object

In [ ]:
#10 lakhs
#10k null values - , column, age, balance, Tenure, gender, output

In [72]:
import numpy as np
import pandas as pd

In [76]:
a={'A':[1,2,3,np.nan,4,5,np.nan],
  'B':[np.nan,20,21,np.nan,22,23,24],
  'C':[11,12,13,np.nan,np.nan,14,15]}

In [77]:
a

{'A': [1, 2, 3, nan, 4, 5, nan],
 'B': [nan, 20, 21, nan, 22, 23, 24],
 'C': [11, 12, 13, nan, nan, 14, 15]}

In [80]:
df=pd.DataFrame(a)

In [81]:
df

     A     B     C
0  1.0   NaN  11.0
1  2.0  20.0  12.0
2  3.0  21.0  13.0
3  NaN   NaN   NaN
4  4.0  22.0   NaN
5  5.0  23.0  14.0
6  NaN  24.0  15.0

In [84]:
df[df['C'].isnull()]

     A     B   C
3  NaN   NaN NaN
4  4.0  22.0 NaN

In [86]:
df.isnull()

       A      B      C
0  False   True  False
1  False  False  False
2  False  False  False
3   True   True   True
4  False  False   True
5  False  False  False
6   True  False  False

In [92]:
df[df.isnull().any(axis=1)]

     A     B     C
0  1.0   NaN  11.0
3  NaN   NaN   NaN
4  4.0  22.0   NaN
6  NaN  24.0  15.0

In [93]:
df

     A     B     C
0  1.0   NaN  11.0
1  2.0  20.0  12.0
2  3.0  21.0  13.0
3  NaN   NaN   NaN
4  4.0  22.0   NaN
5  5.0  23.0  14.0
6  NaN  24.0  15.0

#### Working with Dates in Pandas

In [96]:
person = pd.DataFrame({'Name':['Rammohan','Vinay','Durga','John'],
                     'DOB':['3/20/1996','3/16/1999','9/12/1995','7/12/1967'],
                     'EmpID':['E5','E6','E7','E8']})
person

       Name        DOB EmpID
0  Rammohan  3/20/1996    E5
1     Vinay  3/16/1999    E6
2     Durga  9/12/1995    E7
3      John  7/12/1967    E8

In [97]:
person.info() #mm-dd-yy

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   DOB     4 non-null      object
 2   EmpID   4 non-null      object
dtypes: object(3)
memory usage: 224.0+ bytes

In [98]:
person['DOB']=pd.to_datetime(person['DOB'])
person.dtypes

Name             object
DOB      datetime64[ns]
EmpID            object
dtype: object

In [99]:
person #yy-mm-dd

       Name        DOB EmpID
0  Rammohan 1996-03-20    E5
1     Vinay 1999-03-16    E6
2     Durga 1995-09-12    E7
3      John 1967-07-12    E8

In [100]:
person['Month']=person.DOB.dt.month

In [102]:
person['Year']=person.DOB.dt.year
person['Day']=person.DOB.dt.day

In [103]:
person

       Name        DOB EmpID  Month  Year  Day
0  Rammohan 1996-03-20    E5      3  1996   20
1     Vinay 1999-03-16    E6      3  1999   16
2     Durga 1995-09-12    E7      9  1995   12
3      John 1967-07-12    E8      7  1967   12

In [105]:
person['Week Number']=person.DOB.dt.isocalendar().week

In [106]:
person

       Name        DOB EmpID  Month  Year  Day  Week Number
0  Rammohan 1996-03-20    E5      3  1996   20           12
1     Vinay 1999-03-16    E6      3  1999   16           11
2     Durga 1995-09-12    E7      9  1995   12           37
3      John 1967-07-12    E8      7  1967   12           28

In [107]:
person['Day Name']=pd.to_datetime(person['DOB']).dt.day_name()
person['Month Name']=pd.to_datetime(person['DOB']).dt.month_name()

In [108]:
person

,Name,DOB,EmpID,Month,Year,Day,Week Number,Day Name,Month Name
0,Rammohan,1996-03-20,E5,3,1996,20,12,Wednesday,March
1,Vinay,1999-03-16,E6,3,1999,16,11,Tuesday,March
2,Durga,1995-09-12,E7,9,1995,12,37,Tuesday,September
3,John,1967-07-12,E8,7,1967,12,28,Wednesday,July

In [110]:
pd.__version__

'1.1.3'

In [111]:
pd.to_datetime(person['DOB']).min()

Timestamp('1967-07-12 00:00:00')

In [112]:
pd.to_datetime(person['DOB']).max()

Timestamp('1999-03-16 00:00:00')

In [115]:
from datetime import date
person[pd.to_datetime(person['DOB'])>pd.Timestamp(date(1995,9,12))]

,Name,DOB,EmpID,Month,Year,Day,Week Number,Day Name,Month Name
0,Rammohan,1996-03-20,E5,3,1996,20,12,Wednesday,March
1,Vinay,1999-03-16,E6,3,1999,16,11,Tuesday,March

#### Mergining DataFrames

In [122]:
emp1=pd.DataFrame({'empid':['E2','E3','E2'],
                  'Name':['Ram','Durga','Ram']})

In [123]:
emp1

  empid   Name
0    E2    Ram
1    E3  Durga
2    E2    Ram

In [124]:
emp2=pd.DataFrame({'empid':['E23','E33','E24'],
                  'Name':['Vinay','Nikhil','Sandeep']})
emp2

  empid     Name
0   E23    Vinay
1   E33   Nikhil
2   E24  Sandeep

In [127]:
employees=pd.concat([emp1,emp2],ignore_index=True)
employees

  empid     Name
0    E2      Ram
1    E3    Durga
2    E2      Ram
3   E23    Vinay
4   E33   Nikhil
5   E24  Sandeep

In [128]:
employees=employees.reset_index(drop=True)

In [129]:
employees

  empid     Name
0    E2      Ram
1    E3    Durga
2    E2      Ram
3   E23    Vinay
4   E33   Nikhil
5   E24  Sandeep

In [130]:
employees.duplicated()

0    False
1    False
2     True
3    False
4    False
5    False
dtype: bool

In [134]:
employees.drop_duplicates(keep='last',inplace=True)

In [135]:
employees

  empid     Name
1    E3    Durga
2    E2      Ram
3   E23    Vinay
4   E33   Nikhil
5   E24  Sandeep

In [137]:
sal=pd.DataFrame({'empid':['E3','E2','E23','E33','E24'],
                 'salary':['$10,000','$30,000','$50,000','$70,000','$90,000']})

In [138]:
sal

  empid   salary
0    E3  $10,000
1    E2  $30,000
2   E23  $50,000
3   E33  $70,000
4   E24  $90,000

In [139]:
employee_details=pd.merge(employees,sal)

In [140]:
employee_details

  empid     Name   salary
0    E3    Durga  $10,000
1    E2      Ram  $30,000
2   E23    Vinay  $50,000
3   E33   Nikhil  $70,000
4   E24  Sandeep  $90,000

In [141]:
exp=pd.DataFrame({'empid':['E3','E2','E23','E33','E24'],
                 'Experience':['2 years','3 years','4 years','5 years','6 years']})

In [142]:
exp

  empid Experience
0    E3    2 years
1    E2    3 years
2   E23    4 years
3   E33    5 years
4   E24    6 years

In [143]:
salary=pd.merge(employee_details,exp)

In [144]:
salary

  empid     Name   salary Experience
0    E3    Durga  $10,000    2 years
1    E2      Ram  $30,000    3 years
2   E23    Vinay  $50,000    4 years
3   E33   Nikhil  $70,000    5 years
4   E24  Sandeep  $90,000    6 years

In [145]:
type(salary)

pandas.core.frame.DataFrame

In [156]:
salary.to_excel('Salary.xls')

In [147]:
ds=pd.read_csv('Salary.csv')

In [148]:
ds

   Unnamed: 0 empid     Name   salary Experience
0           0    E3    Durga  $10,000    2 years
1           1    E2      Ram  $30,000    3 years
2           2   E23    Vinay  $50,000    4 years
3           3   E33   Nikhil  $70,000    5 years
4           4   E24  Sandeep  $90,000    6 years

In [149]:
del ds['Unnamed: 0']

In [150]:
ds

  empid     Name   salary Experience
0    E3    Durga  $10,000    2 years
1    E2      Ram  $30,000    3 years
2   E23    Vinay  $50,000    4 years
3   E33   Nikhil  $70,000    5 years
4   E24  Sandeep  $90,000    6 years